In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [10]:
df1 = DataFrame(np.arange(8).reshape(2,4), index=pd.Index(['America','China'],name = "Counteries"),
                columns=pd.Index(list('ABCD'), name="Attributes"))
df1

Attributes  A  B  C  D
Counteries
America     0  1  2  3
China       4  5  6  7

In [12]:
#stacking and unstacking DF

stackdf = df1.stack()
stackdf

Counteries  Attributes
America     A             0
            B             1
            C             2
            D             3
China       A             4
            B             5
            C             6
            D             7
dtype: int32

In [14]:
unstackdf = stackdf.unstack()
unstackdf

Attributes  A  B  C  D
Counteries
America     0  1  2  3
China       4  5  6  7

In [19]:
#unstack along column or index

df2 = stackdf.unstack('Counteries')
df2

Counteries  America  China
Attributes
A                 0      4
B                 1      5
C                 2      6
D                 3      7

In [21]:
df3 = stackdf.unstack('Attributes')
df3

Attributes  A  B  C  D
Counteries
America     0  1  2  3
China       4  5  6  7

In [23]:
#stacking and unstacking Series

s1 = Series([5,10,15], index=list('ABC'))
print(s1)

A     5
B    10
C    15
dtype: int64

In [24]:
s2 = Series([15,110,115], index=list('BCD'))
print(s2)

B     15
C    110
D    115
dtype: int64

In [25]:
s3 = pd.concat([s1,s2],keys=['k1','k2'])
s3

k1  A      5
    B     10
    C     15
k2  B     15
    C    110
    D    115
dtype: int64

In [26]:
df_series = s3.unstack()
df_series

      A     B      C      D
k1  5.0  10.0   15.0    NaN
k2  NaN  15.0  110.0  115.0

In [27]:
df_series.stack()

k1  A      5.0
    B     10.0
    C     15.0
k2  B     15.0
    C    110.0
    D    115.0
dtype: float64

In [28]:
df_series.stack(dropna=False)

k1  A      5.0
    B     10.0
    C     15.0
    D      NaN
k2  A      NaN
    B     15.0
    C    110.0
    D    115.0
dtype: float64